***********************************************************************
*    CardDemo - Transaction Dispute Maintain Screen
***********************************************************************
        TITLE 'BMS MAP FOR TRANSACTION DISPUTE MAINTAIN'
CODISUP DFHMSD LANG=COBOL,                                             -
               MODE=INOUT,                                             -
               STORAGE=AUTO,                                           -
               TIOAPFX=YES,                                            -
               TYPE=&&SYSPARM
CDISUPA DFHMDI CTRL=(FREEKB),                                          -
               DSATTS=(COLOR,HILIGHT,PS,VALIDN),                       -
               MAPATTS=(COLOR,HILIGHT,PS,VALIDN),                      -
               SIZE=(24,80)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=5,                                               -
               POS=(1,1),                                              -
               INITIAL='Tran:'
TRNNAME DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               COLOR=BLUE,                                             -
               LENGTH=4,                                               -
               POS=(1,7)
TITLE01 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=YELLOW,                                           -
               LENGTH=40,                                              -
               POS=(1,21)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=5,                                               -
               POS=(1,65),                                             -
               INITIAL='Date:'
CURDATE DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=8,                                               -
               POS=(1,71),                                             -
               INITIAL='mm/dd/yy'
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=5,                                               -
               POS=(2,1),                                              -
               INITIAL='Prog:'
PGMNAME DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=8,                                               -
               POS=(2,7)
TITLE02 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=YELLOW,                                           -
               LENGTH=40,                                              -
               POS=(2,21)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=5,                                               -
               POS=(2,65),                                             -
               INITIAL='Time:'
CURTIME DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=8,                                               -
               POS=(2,71),                                             -
               INITIAL='hh:mm:ss'
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=NEUTRAL,                                          -
               LENGTH=28,                                              -
               POS=(4,26),                                             -
               INITIAL='Maintain Transaction Dispute'
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(6,4),                                              -
               INITIAL='Dispute ID   :'
DISPIDF DFHMDF ATTRB=(UNPROT,IC),                                      -
               COLOR=GREEN,                                            -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=12,                                              -
               POS=(6,21)
        DFHMDF LENGTH=0,                                               -
               POS=(6,34)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(7,4),                                              -
               INITIAL='Tran ID      :'
DTRANID DFHMDF ATTRB=(UNPROT),                                         -
               COLOR=GREEN,                                            -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=16,                                              -
               POS=(7,21)
        DFHMDF LENGTH=0,                                               -
               POS=(7,38)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(8,4),                                              -
               INITIAL='Card Number  :'
DCARDNO DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=GREEN,                                            -
               LENGTH=16,                                              -
               POS=(8,21)
        DFHMDF LENGTH=0,                                               -
               POS=(8,38)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(9,4),                                              -
               INITIAL='Amount       :'
DAMT    DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=GREEN,                                            -
               LENGTH=13,                                              -
               POS=(9,21)
        DFHMDF LENGTH=0,                                               -
               POS=(9,35)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(10,4),                                             -
               INITIAL='Reason Code  :'
DREASON DFHMDF ATTRB=(UNPROT),                                         -
               COLOR=GREEN,                                            -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=4,                                               -
               POS=(10,21)
        DFHMDF LENGTH=0,                                               -
               POS=(10,26)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(11,4),                                             -
               INITIAL='Status       :'
DSTATUS DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=GREEN,                                            -
               LENGTH=2,                                               -
               POS=(11,21)
        DFHMDF LENGTH=0,                                               -
               POS=(11,24)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=5,                                               -
               POS=(11,26),                                            -
               INITIAL='Desc:'
DSTSDSC DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=GREEN,                                            -
               LENGTH=30,                                              -
               POS=(11,33)
        DFHMDF LENGTH=0,                                               -
               POS=(11,64)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(12,4),                                             -
               INITIAL='New Status   :'
DNEWSTS DFHMDF ATTRB=(UNPROT),                                         -
               COLOR=GREEN,                                            -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=2,                                               -
               POS=(12,21)
        DFHMDF LENGTH=0,                                               -
               POS=(12,24)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(13,4),                                             -
               INITIAL='Opened       :'
DOPENTS DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=GREEN,                                            -
               LENGTH=26,                                              -
               POS=(13,21)
        DFHMDF LENGTH=0,                                               -
               POS=(13,48)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(14,4),                                             -
               INITIAL='Last Update  :'
DUPDTS  DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=GREEN,                                            -
               LENGTH=26,                                              -
               POS=(14,21)
        DFHMDF LENGTH=0,                                               -
               POS=(14,48)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(16,4),                                             -
               INITIAL='Description  :'
DDESC   DFHMDF ATTRB=(UNPROT),                                         -
               COLOR=GREEN,                                            -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=50,                                              -
               POS=(16,21)
        DFHMDF LENGTH=0,                                               -
               POS=(16,72)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(18,4),                                             -
               INITIAL='History Note :'
DNOTE   DFHMDF ATTRB=(UNPROT),                                         -
               COLOR=GREEN,                                            -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=50,                                              -
               POS=(18,21)
        DFHMDF LENGTH=0,                                               -
               POS=(18,72)
INFOMSG DFHMDF ATTRB=(ASKIP),                                          -
               COLOR=NEUTRAL,                                          -
               HILIGHT=OFF,                                            -
               LENGTH=45,                                              -
               POS=(22,23)
        DFHMDF LENGTH=0,                                               -
               POS=(22,69)
ERRMSG  DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               COLOR=RED,                                              -
               LENGTH=78,                                              -
               POS=(23,1)
FKEYS   DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=YELLOW,                                           -
               LENGTH=41,                                              -
               POS=(24,1),                                             -
               INITIAL='ENTER=Fetch  F3=Exit  F5=Save  F12=Cancel'
        DFHMSD TYPE=FINAL
        END
