******************************************************************
*              CardDemo - Transaction Dispute Listing Screen
******************************************************************
        TITLE 'BMS MAP FOR TRAN DISPUTE LISTING'
CODISLI DFHMSD LANG=COBOL,                                             -
               MODE=INOUT,                                             -
               STORAGE=AUTO,                                           -
               TIOAPFX=YES,                                            -
               TYPE=&&SYSPARM
CDISLIA DFHMDI CTRL=(FREEKB),                                          -
               DSATTS=(COLOR,HILIGHT,PS,VALIDN),                       -
               MAPATTS=(COLOR,HILIGHT,PS,VALIDN),                      -
               SIZE=(24,80)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=5,                                               -
               POS=(1,1),                                              -
               INITIAL='Tran:'
TRNNAME DFHMDF ATTRB=(ASKIP,FSET,NORM),                                -
               COLOR=BLUE,                                             -
               LENGTH=4,                                               -
               POS=(1,7)
TITLE01 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=YELLOW,                                           -
               LENGTH=40,                                              -
               POS=(1,21)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=5,                                               -
               POS=(1,65),                                             -
               INITIAL='Date:'
CURDATE DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=8,                                               -
               POS=(1,71),                                             -
               INITIAL='mm/dd/yy'
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=5,                                               -
               POS=(2,1),                                              -
               INITIAL='Prog:'
PGMNAME DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=8,                                               -
               POS=(2,7)
TITLE02 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=YELLOW,                                           -
               LENGTH=40,                                              -
               POS=(2,21)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=5,                                               -
               POS=(2,65),                                             -
               INITIAL='Time:'
CURTIME DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=BLUE,                                             -
               LENGTH=8,                                               -
               POS=(2,71),                                             -
               INITIAL='hh:mm:ss'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=24,                                              -
               POS=(4,28),                                             -
               INITIAL='Transaction Dispute List'
        DFHMDF LENGTH=5,                                               -
               POS=(4,70),                                             -
               INITIAL='Page '
PAGENO  DFHMDF LENGTH=3,                                               -
               POS=(4,76)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=14,                                              -
               POS=(6,29),                                             -
               INITIAL='Status Filter:'
DSTATF  DFHMDF ATTRB=(FSET,IC,NORM,UNPROT),                            -
               COLOR=GREEN,                                            -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=2,                                               -
               POS=(6,44)
        DFHMDF LENGTH=0,                                               -
               POS=(6,47)
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=19,                                              -
               POS=(7,4),                                              -
               INITIAL='Card Number Filter:'
DCARDF  DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               COLOR=GREEN,                                            -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=16,                                              -
               POS=(7,25)
        DFHMDF LENGTH=0,                                               -
               POS=(7,42)
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=3,                                               -
               POS=(9,5),                                              -
               INITIAL='Sel'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=10,                                              -
               POS=(9,9),                                              -
               INITIAL='Dispute ID'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=11,                                              -
               POS=(9,23),                                             -
               INITIAL='Card Number'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=6,                                               -
               POS=(9,44),                                             -
               INITIAL='Amount'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=6,                                               -
               POS=(9,60),                                             -
               INITIAL='Status'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=3,                                               -
               POS=(10,5),                                             -
               INITIAL='---'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=12,                                              -
               POS=(10,9),                                             -
               INITIAL='------------'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=16,                                              -
               POS=(10,23),                                            -
               INITIAL='----------------'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=13,                                              -
               POS=(10,41),                                            -
               INITIAL='-------------'
        DFHMDF COLOR=NEUTRAL,                                          -
               LENGTH=24,                                              -
               POS=(10,56),                                            -
               INITIAL='------------------------'
DSPSEL1 DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               COLOR=DEFAULT,                                          -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=1,                                               -
               POS=(11,6)
        DFHMDF LENGTH=0,                                               -
               POS=(11,8)
DSPID1  DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=12,                                              -
               POS=(11,9)
        DFHMDF LENGTH=0,                                               -
               POS=(11,22)
DSPCRD1 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=16,                                              -
               POS=(11,23)
        DFHMDF LENGTH=0,                                               -
               POS=(11,40)
DSPAMT1 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=13,                                              -
               POS=(11,41)
        DFHMDF LENGTH=0,                                               -
               POS=(11,55)
DSPSTS1 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=24,                                              -
               POS=(11,56)
DSPSEL2 DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               COLOR=DEFAULT,                                          -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=1,                                               -
               POS=(12,6)
        DFHMDF LENGTH=0,                                               -
               POS=(12,8)
DSPID2  DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=12,                                              -
               POS=(12,9)
        DFHMDF LENGTH=0,                                               -
               POS=(12,22)
DSPCRD2 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=16,                                              -
               POS=(12,23)
        DFHMDF LENGTH=0,                                               -
               POS=(12,40)
DSPAMT2 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=13,                                              -
               POS=(12,41)
        DFHMDF LENGTH=0,                                               -
               POS=(12,55)
DSPSTS2 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=24,                                              -
               POS=(12,56)
DSPSEL3 DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               COLOR=DEFAULT,                                          -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=1,                                               -
               POS=(13,6)
        DFHMDF LENGTH=0,                                               -
               POS=(13,8)
DSPID3  DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=12,                                              -
               POS=(13,9)
        DFHMDF LENGTH=0,                                               -
               POS=(13,22)
DSPCRD3 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=16,                                              -
               POS=(13,23)
        DFHMDF LENGTH=0,                                               -
               POS=(13,40)
DSPAMT3 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=13,                                              -
               POS=(13,41)
        DFHMDF LENGTH=0,                                               -
               POS=(13,55)
DSPSTS3 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=24,                                              -
               POS=(13,56)
DSPSEL4 DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               COLOR=DEFAULT,                                          -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=1,                                               -
               POS=(14,6)
        DFHMDF LENGTH=0,                                               -
               POS=(14,8)
DSPID4  DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=12,                                              -
               POS=(14,9)
        DFHMDF LENGTH=0,                                               -
               POS=(14,22)
DSPCRD4 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=16,                                              -
               POS=(14,23)
        DFHMDF LENGTH=0,                                               -
               POS=(14,40)
DSPAMT4 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=13,                                              -
               POS=(14,41)
        DFHMDF LENGTH=0,                                               -
               POS=(14,55)
DSPSTS4 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=24,                                              -
               POS=(14,56)
DSPSEL5 DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               COLOR=DEFAULT,                                          -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=1,                                               -
               POS=(15,6)
        DFHMDF LENGTH=0,                                               -
               POS=(15,8)
DSPID5  DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=12,                                              -
               POS=(15,9)
        DFHMDF LENGTH=0,                                               -
               POS=(15,22)
DSPCRD5 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=16,                                              -
               POS=(15,23)
        DFHMDF LENGTH=0,                                               -
               POS=(15,40)
DSPAMT5 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=13,                                              -
               POS=(15,41)
        DFHMDF LENGTH=0,                                               -
               POS=(15,55)
DSPSTS5 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=24,                                              -
               POS=(15,56)
DSPSEL6 DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               COLOR=DEFAULT,                                          -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=1,                                               -
               POS=(16,6)
        DFHMDF LENGTH=0,                                               -
               POS=(16,8)
DSPID6  DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=12,                                              -
               POS=(16,9)
        DFHMDF LENGTH=0,                                               -
               POS=(16,22)
DSPCRD6 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=16,                                              -
               POS=(16,23)
        DFHMDF LENGTH=0,                                               -
               POS=(16,40)
DSPAMT6 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=13,                                              -
               POS=(16,41)
        DFHMDF LENGTH=0,                                               -
               POS=(16,55)
DSPSTS6 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=24,                                              -
               POS=(16,56)
DSPSEL7 DFHMDF ATTRB=(FSET,NORM,UNPROT),                               -
               COLOR=DEFAULT,                                          -
               HILIGHT=UNDERLINE,                                      -
               LENGTH=1,                                               -
               POS=(17,6)
        DFHMDF LENGTH=0,                                               -
               POS=(17,8)
DSPID7  DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=12,                                              -
               POS=(17,9)
        DFHMDF LENGTH=0,                                               -
               POS=(17,22)
DSPCRD7 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=16,                                              -
               POS=(17,23)
        DFHMDF LENGTH=0,                                               -
               POS=(17,40)
DSPAMT7 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=13,                                              -
               POS=(17,41)
        DFHMDF LENGTH=0,                                               -
               POS=(17,55)
DSPSTS7 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=DEFAULT,                                          -
               LENGTH=24,                                              -
               POS=(17,56)
INFOMSG DFHMDF ATTRB=(PROT),                                           -
               COLOR=NEUTRAL,                                          -
               HILIGHT=OFF,                                            -
               LENGTH=45,                                              -
               POS=(21,18)
        DFHMDF LENGTH=0,                                               -
               POS=(21,64)
ERRMSG  DFHMDF ATTRB=(ASKIP,BRT,FSET),                                 -
               COLOR=RED,                                              -
               LENGTH=78,                                              -
               POS=(23,1)
BUTNF02 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=7,                                               -
               POS=(24,1),                                             -
               INITIAL='F2=Add'
BUTNF03 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=7,                                               -
               POS=(24,10),                                            -
               INITIAL='F3=Exit'
BUTNF07 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=10,                                              -
               POS=(24,19),                                            -
               INITIAL='F7=Page Up'
BUTNF08 DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=10,                                              -
               POS=(24,32),                                            -
               INITIAL='F8=Page Dn'
        DFHMDF ATTRB=(ASKIP,NORM),                                     -
               COLOR=TURQUOISE,                                        -
               LENGTH=12,                                              -
               POS=(24,45),                                            -
               INITIAL='Enter=Select'
        DFHMSD TYPE=FINAL
        END
