DEFINE MAPSET(CODISLI) GROUP(CARDDEMO)
DESCRIPTION(TRANSACTION DISPUTE LIST MAP)
       RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
DEFINE MAPSET(CODISUP) GROUP(CARDDEMO)
DESCRIPTION(TRANSACTION DISPUTE MAINTENANCE MAP)
       RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
DEFINE PROGRAM(CODISLIC) GROUP(CARDDEMO)
       LANGUAGE(COBOL) RELOAD(YES) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)
       TRANSID(CDSL) EXECUTIONSET(FULLAPI) JVM(NO)
DEFINE PROGRAM(CODISUPC) GROUP(CARDDEMO)
       LANGUAGE(COBOL) RELOAD(YES) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)
       TRANSID(CDSU) EXECUTIONSET(FULLAPI) JVM(NO)
DEFINE TRANSACTION(CDSL) GROUP(CARDDEMO)
       PROGRAM(CODISLIC) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE TRANSACTION(CDSU) GROUP(CARDDEMO)
       PROGRAM(CODISUPC) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE DB2TRAN(CDSLTRAN) GROUP(CARDDEMO)
DESCRIPTION(DB2TRAN FOR CDSL TRANSACTION)
       ENTRY(CARDDEMO) TRANSID(CDSL)
DEFINE DB2TRAN(CDSUTRAN) GROUP(CARDDEMO)
DESCRIPTION(DB2TRAN FOR CDSU TRANSACTION)
       ENTRY(CARDDEMO) TRANSID(CDSU)
