      ******************************************************************
      *      CardDemo - Transaction Dispute Listing Symbolic Map
      ******************************************************************
       01  CDISLIAI.
           02  FILLER PIC X(12).
           02  TRNNAMEL    COMP  PIC  S9(4).
           02  TRNNAMEF    PICTURE X.
           02  FILLER REDEFINES TRNNAMEF.
             03 TRNNAMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TRNNAMEI  PIC X(4).
           02  TITLE01L    COMP  PIC  S9(4).
           02  TITLE01F    PICTURE X.
           02  FILLER REDEFINES TITLE01F.
             03 TITLE01A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITLE01I  PIC X(40).
           02  CURDATEL    COMP  PIC  S9(4).
           02  CURDATEF    PICTURE X.
           02  FILLER REDEFINES CURDATEF.
             03 CURDATEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CURDATEI  PIC X(8).
           02  PGMNAMEL    COMP  PIC  S9(4).
           02  PGMNAMEF    PICTURE X.
           02  FILLER REDEFINES PGMNAMEF.
             03 PGMNAMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PGMNAMEI  PIC X(8).
           02  TITLE02L    COMP  PIC  S9(4).
           02  TITLE02F    PICTURE X.
           02  FILLER REDEFINES TITLE02F.
             03 TITLE02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  TITLE02I  PIC X(40).
           02  CURTIMEL    COMP  PIC  S9(4).
           02  CURTIMEF    PICTURE X.
           02  FILLER REDEFINES CURTIMEF.
             03 CURTIMEA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  CURTIMEI  PIC X(8).
           02  PAGENOL    COMP  PIC  S9(4).
           02  PAGENOF    PICTURE X.
           02  FILLER REDEFINES PAGENOF.
             03 PAGENOA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  PAGENOI  PIC X(3).
           02  DSTATFL    COMP  PIC  S9(4).
           02  DSTATFF    PICTURE X.
           02  FILLER REDEFINES DSTATFF.
             03 DSTATFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSTATFI  PIC X(2).
           02  DCARDFL    COMP  PIC  S9(4).
           02  DCARDFF    PICTURE X.
           02  FILLER REDEFINES DCARDFF.
             03 DCARDFA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DCARDFI  PIC X(16).
           02  DSPSEL1L    COMP  PIC  S9(4).
           02  DSPSEL1F    PICTURE X.
           02  FILLER REDEFINES DSPSEL1F.
             03 DSPSEL1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSEL1I  PIC X(1).
           02  DSPID1L    COMP  PIC  S9(4).
           02  DSPID1F    PICTURE X.
           02  FILLER REDEFINES DSPID1F.
             03 DSPID1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPID1I  PIC X(12).
           02  DSPCRD1L    COMP  PIC  S9(4).
           02  DSPCRD1F    PICTURE X.
           02  FILLER REDEFINES DSPCRD1F.
             03 DSPCRD1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPCRD1I  PIC X(16).
           02  DSPAMT1L    COMP  PIC  S9(4).
           02  DSPAMT1F    PICTURE X.
           02  FILLER REDEFINES DSPAMT1F.
             03 DSPAMT1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPAMT1I  PIC X(13).
           02  DSPSTS1L    COMP  PIC  S9(4).
           02  DSPSTS1F    PICTURE X.
           02  FILLER REDEFINES DSPSTS1F.
             03 DSPSTS1A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSTS1I  PIC X(24).
           02  DSPSEL2L    COMP  PIC  S9(4).
           02  DSPSEL2F    PICTURE X.
           02  FILLER REDEFINES DSPSEL2F.
             03 DSPSEL2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSEL2I  PIC X(1).
           02  DSPID2L    COMP  PIC  S9(4).
           02  DSPID2F    PICTURE X.
           02  FILLER REDEFINES DSPID2F.
             03 DSPID2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPID2I  PIC X(12).
           02  DSPCRD2L    COMP  PIC  S9(4).
           02  DSPCRD2F    PICTURE X.
           02  FILLER REDEFINES DSPCRD2F.
             03 DSPCRD2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPCRD2I  PIC X(16).
           02  DSPAMT2L    COMP  PIC  S9(4).
           02  DSPAMT2F    PICTURE X.
           02  FILLER REDEFINES DSPAMT2F.
             03 DSPAMT2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPAMT2I  PIC X(13).
           02  DSPSTS2L    COMP  PIC  S9(4).
           02  DSPSTS2F    PICTURE X.
           02  FILLER REDEFINES DSPSTS2F.
             03 DSPSTS2A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSTS2I  PIC X(24).
           02  DSPSEL3L    COMP  PIC  S9(4).
           02  DSPSEL3F    PICTURE X.
           02  FILLER REDEFINES DSPSEL3F.
             03 DSPSEL3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSEL3I  PIC X(1).
           02  DSPID3L    COMP  PIC  S9(4).
           02  DSPID3F    PICTURE X.
           02  FILLER REDEFINES DSPID3F.
             03 DSPID3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPID3I  PIC X(12).
           02  DSPCRD3L    COMP  PIC  S9(4).
           02  DSPCRD3F    PICTURE X.
           02  FILLER REDEFINES DSPCRD3F.
             03 DSPCRD3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPCRD3I  PIC X(16).
           02  DSPAMT3L    COMP  PIC  S9(4).
           02  DSPAMT3F    PICTURE X.
           02  FILLER REDEFINES DSPAMT3F.
             03 DSPAMT3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPAMT3I  PIC X(13).
           02  DSPSTS3L    COMP  PIC  S9(4).
           02  DSPSTS3F    PICTURE X.
           02  FILLER REDEFINES DSPSTS3F.
             03 DSPSTS3A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSTS3I  PIC X(24).
           02  DSPSEL4L    COMP  PIC  S9(4).
           02  DSPSEL4F    PICTURE X.
           02  FILLER REDEFINES DSPSEL4F.
             03 DSPSEL4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSEL4I  PIC X(1).
           02  DSPID4L    COMP  PIC  S9(4).
           02  DSPID4F    PICTURE X.
           02  FILLER REDEFINES DSPID4F.
             03 DSPID4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPID4I  PIC X(12).
           02  DSPCRD4L    COMP  PIC  S9(4).
           02  DSPCRD4F    PICTURE X.
           02  FILLER REDEFINES DSPCRD4F.
             03 DSPCRD4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPCRD4I  PIC X(16).
           02  DSPAMT4L    COMP  PIC  S9(4).
           02  DSPAMT4F    PICTURE X.
           02  FILLER REDEFINES DSPAMT4F.
             03 DSPAMT4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPAMT4I  PIC X(13).
           02  DSPSTS4L    COMP  PIC  S9(4).
           02  DSPSTS4F    PICTURE X.
           02  FILLER REDEFINES DSPSTS4F.
             03 DSPSTS4A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSTS4I  PIC X(24).
           02  DSPSEL5L    COMP  PIC  S9(4).
           02  DSPSEL5F    PICTURE X.
           02  FILLER REDEFINES DSPSEL5F.
             03 DSPSEL5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSEL5I  PIC X(1).
           02  DSPID5L    COMP  PIC  S9(4).
           02  DSPID5F    PICTURE X.
           02  FILLER REDEFINES DSPID5F.
             03 DSPID5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPID5I  PIC X(12).
           02  DSPCRD5L    COMP  PIC  S9(4).
           02  DSPCRD5F    PICTURE X.
           02  FILLER REDEFINES DSPCRD5F.
             03 DSPCRD5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPCRD5I  PIC X(16).
           02  DSPAMT5L    COMP  PIC  S9(4).
           02  DSPAMT5F    PICTURE X.
           02  FILLER REDEFINES DSPAMT5F.
             03 DSPAMT5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPAMT5I  PIC X(13).
           02  DSPSTS5L    COMP  PIC  S9(4).
           02  DSPSTS5F    PICTURE X.
           02  FILLER REDEFINES DSPSTS5F.
             03 DSPSTS5A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSTS5I  PIC X(24).
           02  DSPSEL6L    COMP  PIC  S9(4).
           02  DSPSEL6F    PICTURE X.
           02  FILLER REDEFINES DSPSEL6F.
             03 DSPSEL6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSEL6I  PIC X(1).
           02  DSPID6L    COMP  PIC  S9(4).
           02  DSPID6F    PICTURE X.
           02  FILLER REDEFINES DSPID6F.
             03 DSPID6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPID6I  PIC X(12).
           02  DSPCRD6L    COMP  PIC  S9(4).
           02  DSPCRD6F    PICTURE X.
           02  FILLER REDEFINES DSPCRD6F.
             03 DSPCRD6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPCRD6I  PIC X(16).
           02  DSPAMT6L    COMP  PIC  S9(4).
           02  DSPAMT6F    PICTURE X.
           02  FILLER REDEFINES DSPAMT6F.
             03 DSPAMT6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPAMT6I  PIC X(13).
           02  DSPSTS6L    COMP  PIC  S9(4).
           02  DSPSTS6F    PICTURE X.
           02  FILLER REDEFINES DSPSTS6F.
             03 DSPSTS6A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSTS6I  PIC X(24).
           02  DSPSEL7L    COMP  PIC  S9(4).
           02  DSPSEL7F    PICTURE X.
           02  FILLER REDEFINES DSPSEL7F.
             03 DSPSEL7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSEL7I  PIC X(1).
           02  DSPID7L    COMP  PIC  S9(4).
           02  DSPID7F    PICTURE X.
           02  FILLER REDEFINES DSPID7F.
             03 DSPID7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPID7I  PIC X(12).
           02  DSPCRD7L    COMP  PIC  S9(4).
           02  DSPCRD7F    PICTURE X.
           02  FILLER REDEFINES DSPCRD7F.
             03 DSPCRD7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPCRD7I  PIC X(16).
           02  DSPAMT7L    COMP  PIC  S9(4).
           02  DSPAMT7F    PICTURE X.
           02  FILLER REDEFINES DSPAMT7F.
             03 DSPAMT7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPAMT7I  PIC X(13).
           02  DSPSTS7L    COMP  PIC  S9(4).
           02  DSPSTS7F    PICTURE X.
           02  FILLER REDEFINES DSPSTS7F.
             03 DSPSTS7A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  DSPSTS7I  PIC X(24).
           02  INFOMSGL    COMP  PIC  S9(4).
           02  INFOMSGF    PICTURE X.
           02  FILLER REDEFINES INFOMSGF.
             03 INFOMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  INFOMSGI  PIC X(45).
           02  ERRMSGL    COMP  PIC  S9(4).
           02  ERRMSGF    PICTURE X.
           02  FILLER REDEFINES ERRMSGF.
             03 ERRMSGA    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  ERRMSGI  PIC X(78).
           02  BUTNF02L    COMP  PIC  S9(4).
           02  BUTNF02F    PICTURE X.
           02  FILLER REDEFINES BUTNF02F.
             03 BUTNF02A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BUTNF02I  PIC X(7).
           02  BUTNF03L    COMP  PIC  S9(4).
           02  BUTNF03F    PICTURE X.
           02  FILLER REDEFINES BUTNF03F.
             03 BUTNF03A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BUTNF03I  PIC X(7).
           02  BUTNF07L    COMP  PIC  S9(4).
           02  BUTNF07F    PICTURE X.
           02  FILLER REDEFINES BUTNF07F.
             03 BUTNF07A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BUTNF07I  PIC X(10).
           02  BUTNF08L    COMP  PIC  S9(4).
           02  BUTNF08F    PICTURE X.
           02  FILLER REDEFINES BUTNF08F.
             03 BUTNF08A    PICTURE X.
           02  FILLER   PICTURE X(4).
           02  BUTNF08I  PIC X(10).
       01  CDISLIAO REDEFINES CDISLIAI.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  TRNNAMEC    PICTURE X.
           02  TRNNAMEP    PICTURE X.
           02  TRNNAMEH    PICTURE X.
           02  TRNNAMEV    PICTURE X.
           02  TRNNAMEO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  TITLE01C    PICTURE X.
           02  TITLE01P    PICTURE X.
           02  TITLE01H    PICTURE X.
           02  TITLE01V    PICTURE X.
           02  TITLE01O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURDATEC    PICTURE X.
           02  CURDATEP    PICTURE X.
           02  CURDATEH    PICTURE X.
           02  CURDATEV    PICTURE X.
           02  CURDATEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PGMNAMEC    PICTURE X.
           02  PGMNAMEP    PICTURE X.
           02  PGMNAMEH    PICTURE X.
           02  PGMNAMEV    PICTURE X.
           02  PGMNAMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  TITLE02C    PICTURE X.
           02  TITLE02P    PICTURE X.
           02  TITLE02H    PICTURE X.
           02  TITLE02V    PICTURE X.
           02  TITLE02O  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CURTIMEC    PICTURE X.
           02  CURTIMEP    PICTURE X.
           02  CURTIMEH    PICTURE X.
           02  CURTIMEV    PICTURE X.
           02  CURTIMEO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  PAGENOC    PICTURE X.
           02  PAGENOP    PICTURE X.
           02  PAGENOH    PICTURE X.
           02  PAGENOV    PICTURE X.
           02  PAGENOO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  DSTATFC    PICTURE X.
           02  DSTATFP    PICTURE X.
           02  DSTATFH    PICTURE X.
           02  DSTATFV    PICTURE X.
           02  DSTATFO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DCARDFC    PICTURE X.
           02  DCARDFP    PICTURE X.
           02  DCARDFH    PICTURE X.
           02  DCARDFV    PICTURE X.
           02  DCARDFO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DSPSEL1C    PICTURE X.
           02  DSPSEL1P    PICTURE X.
           02  DSPSEL1H    PICTURE X.
           02  DSPSEL1V    PICTURE X.
           02  DSPSEL1O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DSPID1C    PICTURE X.
           02  DSPID1P    PICTURE X.
           02  DSPID1H    PICTURE X.
           02  DSPID1V    PICTURE X.
           02  DSPID1O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  DSPCRD1C    PICTURE X.
           02  DSPCRD1P    PICTURE X.
           02  DSPCRD1H    PICTURE X.
           02  DSPCRD1V    PICTURE X.
           02  DSPCRD1O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DSPAMT1C    PICTURE X.
           02  DSPAMT1P    PICTURE X.
           02  DSPAMT1H    PICTURE X.
           02  DSPAMT1V    PICTURE X.
           02  DSPAMT1O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DSPSTS1C    PICTURE X.
           02  DSPSTS1P    PICTURE X.
           02  DSPSTS1H    PICTURE X.
           02  DSPSTS1V    PICTURE X.
           02  DSPSTS1O  PIC X(24).
           02  FILLER PICTURE X(3).
           02  DSPSEL2C    PICTURE X.
           02  DSPSEL2P    PICTURE X.
           02  DSPSEL2H    PICTURE X.
           02  DSPSEL2V    PICTURE X.
           02  DSPSEL2O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DSPID2C    PICTURE X.
           02  DSPID2P    PICTURE X.
           02  DSPID2H    PICTURE X.
           02  DSPID2V    PICTURE X.
           02  DSPID2O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  DSPCRD2C    PICTURE X.
           02  DSPCRD2P    PICTURE X.
           02  DSPCRD2H    PICTURE X.
           02  DSPCRD2V    PICTURE X.
           02  DSPCRD2O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DSPAMT2C    PICTURE X.
           02  DSPAMT2P    PICTURE X.
           02  DSPAMT2H    PICTURE X.
           02  DSPAMT2V    PICTURE X.
           02  DSPAMT2O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DSPSTS2C    PICTURE X.
           02  DSPSTS2P    PICTURE X.
           02  DSPSTS2H    PICTURE X.
           02  DSPSTS2V    PICTURE X.
           02  DSPSTS2O  PIC X(24).
           02  FILLER PICTURE X(3).
           02  DSPSEL3C    PICTURE X.
           02  DSPSEL3P    PICTURE X.
           02  DSPSEL3H    PICTURE X.
           02  DSPSEL3V    PICTURE X.
           02  DSPSEL3O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DSPID3C    PICTURE X.
           02  DSPID3P    PICTURE X.
           02  DSPID3H    PICTURE X.
           02  DSPID3V    PICTURE X.
           02  DSPID3O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  DSPCRD3C    PICTURE X.
           02  DSPCRD3P    PICTURE X.
           02  DSPCRD3H    PICTURE X.
           02  DSPCRD3V    PICTURE X.
           02  DSPCRD3O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DSPAMT3C    PICTURE X.
           02  DSPAMT3P    PICTURE X.
           02  DSPAMT3H    PICTURE X.
           02  DSPAMT3V    PICTURE X.
           02  DSPAMT3O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DSPSTS3C    PICTURE X.
           02  DSPSTS3P    PICTURE X.
           02  DSPSTS3H    PICTURE X.
           02  DSPSTS3V    PICTURE X.
           02  DSPSTS3O  PIC X(24).
           02  FILLER PICTURE X(3).
           02  DSPSEL4C    PICTURE X.
           02  DSPSEL4P    PICTURE X.
           02  DSPSEL4H    PICTURE X.
           02  DSPSEL4V    PICTURE X.
           02  DSPSEL4O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DSPID4C    PICTURE X.
           02  DSPID4P    PICTURE X.
           02  DSPID4H    PICTURE X.
           02  DSPID4V    PICTURE X.
           02  DSPID4O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  DSPCRD4C    PICTURE X.
           02  DSPCRD4P    PICTURE X.
           02  DSPCRD4H    PICTURE X.
           02  DSPCRD4V    PICTURE X.
           02  DSPCRD4O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DSPAMT4C    PICTURE X.
           02  DSPAMT4P    PICTURE X.
           02  DSPAMT4H    PICTURE X.
           02  DSPAMT4V    PICTURE X.
           02  DSPAMT4O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DSPSTS4C    PICTURE X.
           02  DSPSTS4P    PICTURE X.
           02  DSPSTS4H    PICTURE X.
           02  DSPSTS4V    PICTURE X.
           02  DSPSTS4O  PIC X(24).
           02  FILLER PICTURE X(3).
           02  DSPSEL5C    PICTURE X.
           02  DSPSEL5P    PICTURE X.
           02  DSPSEL5H    PICTURE X.
           02  DSPSEL5V    PICTURE X.
           02  DSPSEL5O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DSPID5C    PICTURE X.
           02  DSPID5P    PICTURE X.
           02  DSPID5H    PICTURE X.
           02  DSPID5V    PICTURE X.
           02  DSPID5O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  DSPCRD5C    PICTURE X.
           02  DSPCRD5P    PICTURE X.
           02  DSPCRD5H    PICTURE X.
           02  DSPCRD5V    PICTURE X.
           02  DSPCRD5O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DSPAMT5C    PICTURE X.
           02  DSPAMT5P    PICTURE X.
           02  DSPAMT5H    PICTURE X.
           02  DSPAMT5V    PICTURE X.
           02  DSPAMT5O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DSPSTS5C    PICTURE X.
           02  DSPSTS5P    PICTURE X.
           02  DSPSTS5H    PICTURE X.
           02  DSPSTS5V    PICTURE X.
           02  DSPSTS5O  PIC X(24).
           02  FILLER PICTURE X(3).
           02  DSPSEL6C    PICTURE X.
           02  DSPSEL6P    PICTURE X.
           02  DSPSEL6H    PICTURE X.
           02  DSPSEL6V    PICTURE X.
           02  DSPSEL6O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DSPID6C    PICTURE X.
           02  DSPID6P    PICTURE X.
           02  DSPID6H    PICTURE X.
           02  DSPID6V    PICTURE X.
           02  DSPID6O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  DSPCRD6C    PICTURE X.
           02  DSPCRD6P    PICTURE X.
           02  DSPCRD6H    PICTURE X.
           02  DSPCRD6V    PICTURE X.
           02  DSPCRD6O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DSPAMT6C    PICTURE X.
           02  DSPAMT6P    PICTURE X.
           02  DSPAMT6H    PICTURE X.
           02  DSPAMT6V    PICTURE X.
           02  DSPAMT6O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DSPSTS6C    PICTURE X.
           02  DSPSTS6P    PICTURE X.
           02  DSPSTS6H    PICTURE X.
           02  DSPSTS6V    PICTURE X.
           02  DSPSTS6O  PIC X(24).
           02  FILLER PICTURE X(3).
           02  DSPSEL7C    PICTURE X.
           02  DSPSEL7P    PICTURE X.
           02  DSPSEL7H    PICTURE X.
           02  DSPSEL7V    PICTURE X.
           02  DSPSEL7O  PIC X(1).
           02  FILLER PICTURE X(3).
           02  DSPID7C    PICTURE X.
           02  DSPID7P    PICTURE X.
           02  DSPID7H    PICTURE X.
           02  DSPID7V    PICTURE X.
           02  DSPID7O  PIC X(12).
           02  FILLER PICTURE X(3).
           02  DSPCRD7C    PICTURE X.
           02  DSPCRD7P    PICTURE X.
           02  DSPCRD7H    PICTURE X.
           02  DSPCRD7V    PICTURE X.
           02  DSPCRD7O  PIC X(16).
           02  FILLER PICTURE X(3).
           02  DSPAMT7C    PICTURE X.
           02  DSPAMT7P    PICTURE X.
           02  DSPAMT7H    PICTURE X.
           02  DSPAMT7V    PICTURE X.
           02  DSPAMT7O  PIC X(13).
           02  FILLER PICTURE X(3).
           02  DSPSTS7C    PICTURE X.
           02  DSPSTS7P    PICTURE X.
           02  DSPSTS7H    PICTURE X.
           02  DSPSTS7V    PICTURE X.
           02  DSPSTS7O  PIC X(24).
           02  FILLER PICTURE X(3).
           02  INFOMSGC    PICTURE X.
           02  INFOMSGP    PICTURE X.
           02  INFOMSGH    PICTURE X.
           02  INFOMSGV    PICTURE X.
           02  INFOMSGO  PIC X(45).
           02  FILLER PICTURE X(3).
           02  ERRMSGC    PICTURE X.
           02  ERRMSGP    PICTURE X.
           02  ERRMSGH    PICTURE X.
           02  ERRMSGV    PICTURE X.
           02  ERRMSGO  PIC X(78).
           02  FILLER PICTURE X(3).
           02  BUTNF02C    PICTURE X.
           02  BUTNF02P    PICTURE X.
           02  BUTNF02H    PICTURE X.
           02  BUTNF02V    PICTURE X.
           02  BUTNF02O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  BUTNF03C    PICTURE X.
           02  BUTNF03P    PICTURE X.
           02  BUTNF03H    PICTURE X.
           02  BUTNF03V    PICTURE X.
           02  BUTNF03O  PIC X(7).
           02  FILLER PICTURE X(3).
           02  BUTNF07C    PICTURE X.
           02  BUTNF07P    PICTURE X.
           02  BUTNF07H    PICTURE X.
           02  BUTNF07V    PICTURE X.
           02  BUTNF07O  PIC X(10).
           02  FILLER PICTURE X(3).
           02  BUTNF08C    PICTURE X.
           02  BUTNF08P    PICTURE X.
           02  BUTNF08H    PICTURE X.
           02  BUTNF08V    PICTURE X.
           02  BUTNF08O  PIC X(10).
